import pandas as pd

data = {
    "ФИО": [
        "Алаторцев П.В.","Багиров Э.Э.","Башкиров И.В.","Борхоев Б.Б.","Евстафьев А.А.","Журавлева М.Р.","Киреев А.А.","Ламажап Н.А.","Ленючев Д.А.","Львов М.Д.","Макаров Е.С.","Овчинникова И.А.","Подлинный М.В.","Сатин Т.С.","Секункова П.А.","Семечаевский П.В.","Сержантов И.А.","Токарев А.Д.","Чичёв А.Б.","Шахкиримов К.И.","Шишалов С.Д.","Максимов М.М.","Маковский А.С."
    ],
    "Понедельник" : None,
    "Вторник": None,
    "Четверг": None,
    "Пятница": None,
    "Суббота": None,
}

def reforming_list(absentees):
    for i, name in enumerate(data["ФИО"]):
        for day in ["Понедельник", "Вторник", "Четверг", "Пятница", "Суббота"]:
            if name in absentees:
                if data[day] is None:
                    data[day] = [None] * len(data["ФИО"])
                data[day][i] = "н"

absentees = [
    "Токарев А.Д.",
    "Чичёв А.Б.",
    "Шахкиримов К.И.",
    "Шишалов С.Д.",
]

reforming_list(absentees)

df = pd.DataFrame(data)

file_path = "ИСП11-322АП.xlsx"

# Сохраняем DataFrame в файл Excel
df.to_excel(file_path, index=False)

print(f"Файл сохранен как: {file_path}")