import pandas as pd
import random

data = {
    "ФИО": [
        "Алаторцев Павел", "Багиров Эльвин", "Башкиров Илья", "Борхоев Бато",
        "Евстафьев Артём", "Журавлева Мария", "Киреев Александр", "Ламажап Найыр",
        "Ленючев Данила", "Львов Максим", "Макаров Евгений", "Маковский Александр",
        "Максимов Максим", "Овчинникова Ирина", "Подлинный Максим", "Сатин Тимофей",
        "Секункова Полина", "Семечаевский Павел", "Сержантов Илья", "Токарев Алексей",
        "Чичёв Артём", "Шахкиримов Кирилл", "Шишалов Святослав"
    ],
    "Понедельник": [random.choice([None, "", "н"]) for _ in range(23)],
    "Вторник": [random.choice([None, "", "н"]) for _ in range(23)],
    "Четверг": [random.choice([None, "", "н"]) for _ in range(23)],
    "Пятница": [random.choice([None, "", "н"]) for _ in range(23)],
    "Суббота": [random.choice([None, "", "н"]) for _ in range(23)]
}


df = pd.DataFrame(data)


file_path = "ИСП11-322АП.xlsx"

# Сохраняем DataFrame в файл Excel
df.to_excel(file_path, index=False)

print(f"Файл сохранен как: {file_path}")